class Globals:

    def __init__(self):
        self.window_tittle = "Шифратор"
        self.window_size = "500x300"
        self.button_color = "grey"

        self.text_encrypt_tittle = "Шифрование"
        self.text_decode_tittle = "Дешифрование"

        self.text_encrypt_button = "Зашифровать"
        self.text_decode_button = "Дешифровать"

        self.text_incode_img = "Закодировать"
        self.text_decode_img = "Декодировать"

        self.text_caesar = "Цезаря"
        self.text_visener = "Виженера"
        self.text_vernam = "Вернама"
        self.text_morse = "Азбуки Морзе"
        self.text_count_morse = "Цезаря частотным анализом"

        self.text_bmp = "bmp"
        self.text_jpg = "jpg"
        self.text_png = "png"

        self.numbers = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
        self.en_alphabet = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r',
                            's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
        self.EN_alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R',
                            'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
        self.rus_alphabet = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р',
                             'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
        self.RUS_alphabet = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М',
                             'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю',
                             'Я']
        self.symbol = {
            "a": ".-",
            "b": "-...",
            "c": "-.-.",
            "d": "-..",
            "e": ".",
            "f": "..-.",
            "g": "--.",
            "h": "....",
            "i": "..",
            "j": ".---",
            "k": "-.-",
            "l": ".-..",
            "m": "--",
            "n": "-.",
            "o": "---",
            "p": ".--.",
            "q": "--.-",
            "r": ".-.",
            "s": "...",
            "t": "-",
            "u": "..-",
            "v": "...-",
            "w": ".--",
            "x": "-..-",
            "y": "-.--",
            "z": "--..",
            " ": " ",
            ".": "......",
            ",": ".-.-.-",
            "?": "..--..",
            "!": "--..--",
            "0": "-----",
            "1": ".----",
            "2": "..---",
            "3": "...--",
            "4": "....-",
            "5": ".....",
            "6": "-....",
            "7": "--...",
            "8": "---..",
            "9": "----.",
            "а": ".-",
            "б": "-...",
            "в": ".--",
            "г": "--.",
            "д": "-..",
            "е": ".",
            "ё": ".",
            "ж": "...-",
            "з": "--..",
            "и": "..",
            "й": ".---",
            "к": "-.-",
            "л": ".-..",
            "м": "--",
            "н": "-.",
            "о": "---",
            "п": ".--.",
            "р": ".-.",
            "с": "...",
            "т": "-",
            "у": "..-",
            "ф": "..-.",
            "х": "....",
            "ц": "-.-.",
            "ч": "---.",
            "ш": "----",
            "щ": "--.-",
            "ь": "-..-",
            "ъ": "-..-",
            "ы": "-.--",
            "э": "..-..",
            "ю": "..__",
            "я": ".-.-",
            "": "",
        }
